#!/usr/bin/env python3
# -*- coding: utf-8 -*-
__author__  = 'johnson'
__doc__     = '''this file is used to manage global variables'''

# /------------------------数据库连接配置库相关------------------------------/
MYSQL_HOST      = None
MYSQL_PORT      = None
MYSQL_USER      = None
MYSQL_PASSWORD  = None

# /------------------------日志配置库相关-----------------------------------/
service_logger = None
error_logger = None
INTERFACE_METHOD = {} # 接口调用的方法 eg:{方法名：方法参数}

SELECT_SCHOOL_OFFER_SCORE = {} # 根据major_id返回关联申请成功的案例offer的平均成绩


# /------------------------institute_info库相关-----------------------------/

INSTITUTE_ID_TO_NAME_EN = {} # 根据id查询学校英文名
INSTITUTE_ID_TO_NAME_ZH = {} # 根据id查询学校中文名
INSTITUTE_ID_TO_LOCATION = {} # 根据id查询学校地理位置类型（suburban，urban，city，rural）

# /------------------------major_info库相关---------------------------------/

MAJOR = {} # 根据id查询专业

# /------------------------institute_major_level库相关----------------------/

INSTITUTE_MAJOR_LEVEL = {} # 不同专业的学校档次划分

# /------------------------requirement_score库相关--------------------------/

SELECT_SCHOOL_TARGET_SCORE = {} # 目标档次学校的gpa、toefl\ielts、gre\gmat的分数要求'

# /-------------------------------------------------------------------------/

# /------------------------分数换算规则相关----------------------------------/

GRE_TO_GMAT = {} # GRE换算到GMAT的规则

GMAT_TO_GRE = {} # GMAT换算到GRE的规则

GPA_SCORE_LEVEL = { # gpa分数对应的系数
    '1.3'   : '3.9-4.1',
    '1'     : '3.75-3.9',
    '0.9'   : '3.6-3.75',
    '0.85'  : '3.5-3.6',
    '0.75'  : '3.35-3.5',
    '0.65'  : '3.2-3.35',
    '0.6'   : '3.0-3.2',
    '0.55'  : '2.9-3.0',
    '0.5'   : '2.8-2.9',
    '0.4'   : '2.6-2.8',
    '0.26'  : '2.4-2.6',
    '0.1'   : '2.0-2.4',
    '0'     : '0.0-2.0',
}
GPA_SCHOOL_LEVEL = { # 本科学校对应的系数
    1   : 1.3,    # 海本综排Top20
    2   : 1.25,   # 海本综排Top21-Top35
    3   : 1.15,   # 海本综排Top36-Top50
    4   : 1.1,    # 海本综排Top51-Top80
    5   : 1,      # 海本综排Top81-Top120
    6   : 1.2,    # 清华北大
    7   : 1.15,   # 综合前十
    8   : 1.1,    # 专业优势学校
    9   : 1,      # 985&211
    10  : 0.9,    # 211
    11  : 0.8,    # 双非一本
    12  : 0.7,    # 双非二本
}

IBT_LEVEL = { # IBT档次划分
    '115-120'   : 1.5,
    '110-114'   : 1.4,
    '105-109'   : 1.2,
    '100-104'   : 1.1,
    '97-99'     : 0.95,
    '94-96'     : 0.9,
    '90-93'     : 0.8,
    '86-89'     : 0.75,
    '80-85'     : 0.6,
    '75-79'     : 0.5,
    '70-74'     : 0.45,
    '65-69'     : 0.3,
    '0-64'      : 0.1,
}

GRE_LEVEL = { # GRE档次划分
    '330-340'   : 1.3,
    '325-329'   : 1.2,
    '320-324'   : 1.1,
    '316-319'   : 0.95,
    '310-315'   : 0.8,
    '305-309'   : 0.65,
    '300-304'   : 0.5,
    '0-299'     : 0.25,
}

GMAT_LEVEL = { # GMAT档次划分
    '760-800'   : 1.3,
    '720-759'   : 1.2,
    '700-719'   : 1.1,
    '680-699'   : 0.95,
    '650-679'   : 0.8,
    '600-649'   : 0.7,
    '550-599'   : 0.5,
    '0-549'     : 0.25,

}

SUBJECT_SCORE = { # 各大类学科分数
    'liberal_art'   : '25-35-20',
    'science'       : '45-25-20',
    'commerce'      : '25-30-25',
    'engineering'   : '45-25-25',
    'other'         : '35-30-25',
}

SCHOOL_LEVEL = { # 本科学校对应的档次
    '海外综排top20' : 1,
    '海外综排top21-35': 2,
    '海外综排top36-50': 3,
    '海外综排top51-80': 4,
    '海外综排top81-120': 5,
    '海外综排靠后': 10,
    '清华北大': 6,
    '985': 9,
    '211': 10,
    '双非一本': 11,
    '双非二本': 12
}
# /-------------------------------------------------------------------------/